# üêç SQL in Python üêç

This file intends to execute sql queries in python reading them from a sql script.

### 1Ô∏è‚É£ Importing the required libraries

In [1]:
import pandas as pd
import mysql.connector
import re

### 2Ô∏è‚É£ Setting connection and cursor

In [2]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='sakila')

In [3]:
mycursor = cnx.cursor()

### 3Ô∏è‚É£ Opening the sql script

In [109]:
with open("files/script.sql", "r") as file:
    sql_script = file.read()

In [110]:
results = [] # This list will cointain the sql queries outputs 
for query in sql_script.split(";"):
    mycursor.execute(query)
    results.append(mycursor.fetchall())

### 4Ô∏è‚É£ Creating DataFrames for some outputs

First, we need to delete the empty results

In [111]:
for result in results:
    if len(result) == 0:
        results.remove(result)

Now, lets choose the last result and convert it to a DataFrame:

In [112]:
df = pd.DataFrame(results[-1])

In [113]:
df.sample(10)

                      0                1  2
2953     sissy sobieski       mary tandy  1
4733        mena temple      fay winslet  1
3135         milla peck     cate mcqueen  1
8642         cuba allen      salma nolte  1
4662        carmen hunt  vivien basinger  2
9339    morgan williams    gene mckellen  1
504     bette nicholson  julia barrymore  1
1299      vivien bergen      jude cruise  1
3756    jodie degeneres     greta malden  1
715   matthew johansson   matthew carrey  1

This can also be done using `read_sql_query()` pandas method. To do so, we use the sql_script variable and remove the blank spaces in the query.

In [122]:
my_queries_list = sql_script.split(";")
clean_queries = []

for query in my_queries_list:
    query = query.strip()
    if len(query) != 0:
        clean_queries.append(query)

Now, we can convert the queries into DataFrames

In [125]:
df_2 = pd.read_sql_query(clean_queries[-1], cnx)

C:\Users\maria\AppData\Local\Temp\ipykernel_12684\1034347106.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2 = pd.read_sql_query(clean_queries[-1], cnx)

In [126]:
df_2.sample(10)

               actor_1          actor_2  films_together
6951      greg chaplin        ian tandy               2
2040        elvis marx  william hackman               2
2969       tim hackman    rita reynolds               1
1686          dan torn  penelope monroe               2
4909        dan harris       mary tandy               2
3069        milla peck  humphrey willis               1
2494      rip crawford     jayne neeson               1
7875       walter torn  penelope cronyn               1
5093  christian akroyd       chris depp               2
9839      meryl gibson    audrey bailey               1

### 5Ô∏è‚É£ Create csv file from DataFrame

Using the `to_csv()` pandas method, we can save the outputs in a `.csv` file.

In [127]:
df_2.to_csv("files/bonus_query_out.csv")